# 1. შექმენით 4 ლისტი და დაპრინტეთ მათში შეყვანილი ცვლადების რაოდენობა.
# 2. შექმენთ 3 ლისტი და თითოეულს append ფუნქციის გამოყენებით დაუმატეთ 2-2 ცვლადი.
# 3. შექმენით 2 ლისტი. პირველს მე3ე და მე0ე ადგილას დაუმატეთ ცვლადები ხოლო მეორეს მე4ე და მე2ე ადგილას.
# 4. შექმენით 1 ლისტი და ორივედან ამოშალეთ 2 ცვლადი pop ფუნქციის გამოყენებით.
# 5. შექმენით 3 ცვლადი და დაითვალეთ რამდენი სიმბოლოა თითოეულ ცვლადში.\


#1
list = [1,2,3,4,5,6,7]
list_1 = [1,2,3,4]
list_2 = [1,2,3,4,5,6,7,8,9,10]
list_3 = [1,3]

print(len(list))
print(len(list_1))
print(len(list_2))
print(len(list_3))

#2
list = [1,2,3,4,5,6,7]
list_1 = [1,2,3,4]

list.append(8,9)
list_1.append(5,6)

print(list)
print(list_1)

#3
list = [1,2,3,4,5,6,7]
list_1 = [1,2,3,4]

list.insert(3, 'omg')
list_1.insert(0,'დროშა ვერ დაკიდეს!!!!1')

#4
list = [1,2,3,4,5,6,7]

list.pop(1)
list.pop(4)

#5
name = 'achi'
age = 'one'
idk = 'nothing'

print(len(name))
print(len(age))
print(len(idk))