# ```1. შექმენით სია, სადაც გექნებათ 7 სიტყვა, შემდეგ:

# * დადებითი ინდექსინგის მეშვეობით გამოიტანეთ მეორე და მესამე სიტყვა.

# * დადებითი ინდექსინგის მეშვეობით გამოიტანეთ მეხუთედან ყველა სიტყვა ბოლომდე.

# * უარყოფითი ინდექსინგის მეშვეობით გამოიტანეთ მეორე და მესამე სიტყვა.


# * უარყოფითი ინდექსინგის მეშვეობით გამოიტანეთ მეხუთედან ყველა სიტყვა ბოლომდე.

# * უაყოფითი და დადებითი ინდექსინგის, ორივეს მეშვეობით, გამოიტანეთ მესამე ელემენტიდან მეექსვეს ჩათვლით ყველა.

# * გამოიტანეთ სიის ყველა ელემენტი, დადებითი ინდექსინგის მეშვეობით.```


moves = ["superman","iron-man","wonderwomen","shazam","avatar","ameryvan pshico","mr and mrs smith"]


#1
print(moves[1:3])

#2
print(moves[5:])

#3
print(moves[-6:-4])

#4
print(moves[-5:])

#5
print(moves[-5:7])

#6
print(moves[0:8])


