# 1. კომენტარების მეშვეობით დეტალურად ახსენით, თუ რა არის ფუნქცია და ფუნქციის არგუმენტი.

# 2. ჩამოწერე უკვე ნასწავლი ფუნქციის 3-4 მაგალითი.

# 3. შექმენი for loop(), რომელიც 5-ჯერ გამოიტანს 'hello'-ს.

# 4. შექმენი while loop(), რომელიც გამოიტანს 0,1,2,3 ციფრებს.

#1
# ფუნქცია არის კოდის ნაწილი, რომელსაც გარკვეული სახელი აქვს და მისი არგუმენტი არის მონაცემი რაც გადაეცემა

#2
print("hello")
print(type(45))
print(int("hello"))

#3
for i in range(5):
    print("hello")

#4

n = 0
while n < 4:
    print(i)  
    n += 1  

Z